app/controllers/course_instances_controller.rb

SELECT * FROM "course_instances" WHERE ("course_instances"."id" = 124)
---
  def show
    @ci = CourseInstance.find(params[:id])

SELECT * FROM "course_instances" WHERE ("course_instances"."id" = 1)
---
  def feedback

    @ci = CourseInstance.find(params[:id])

SELECT * FROM "course_instances" WHERE ("course_instances"."id" = 0)
INSERT INTO "feedbacks" ("created_at", "updated_at", "course_instance_id", "feedback") VALUES('2009-12-11 04:24:01.962357', '2009-12-11 04:24:01.962357', NULL, E'sdfsfdsa') RETURNING "id"
UPDATE "feedbacks" SET "updated_at" = '2009-12-11 04:24:01.971996', "course_instance_id" = 1 WHERE "id" = 2
---
  def save_feedback
    @ci = CourseInstance.find(params[:id])
    @feedback = Feedback.new(params[:feedback])

    if @feedback.save
      @ci.feedbacks.push(@feedback)