app/controllers/courses_controller.rb

SELECT * FROM "newsfeeds" ORDER BY created_at DESC
SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def index
     @newsfeed = Newsfeed.all
     @courses = Course.find(:all)

SELECT * FROM "courses" WHERE ("courses"."id" = 120)
---
  def show
     @courses = Course.find(params[:id])

INSERT INTO "courses" ("name", "created_at", "updated_at", "description") VALUES(E'sadads', '2009-11-12 23:31:38.316895', '2009-11-12 23:31:38.316895', E'adsad') RETURNING "id"
---
  def create
      @course = Course.new(params[:course])

      if @course.save