app/controllers/courses_controller.rb

  def view
     @courses = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)