app/controllers/exams_controller.rb

SELECT * FROM "exams"
---
  def index
      @ex = Exam.all

SELECT * FROM "exams" WHERE ("exams"."id" = 1)
---
    def show
      @ex = Exam.find(params[:id])