app/controllers/exercise_groups_controller.rb

SELECT * FROM "exercise_groups"
---
  def index
      @eg = ExerciseGroup.all

SELECT * FROM "exercise_groups" WHERE ("exercise_groups"."id" = 5)
---
    def show
      @eg = ExerciseGroup.find(params[:id])

SELECT * FROM "exercise_groups" WHERE ("exercise_groups"."id" = 1)
INSERT INTO "registrations" ("created_at", "updated_at", "exercise_group_id", "user_id", "exam_id") VALUES('2009-12-11 05:53:55.138976', '2009-12-11 05:53:55.138976', 0, 7, 1) RETURNING "id"
---
    def register
      @eg = ExerciseGroup.find(params[:id])

      if @eg.users.nitems < @eg.max_registrations
        @eg.users << session[:user_id]