app/controllers/registrations_controller.rb

SELECT * FROM "registrations" WHERE ("registrations"."exercise_group_id" = E'1') LIMIT 1
SELECT * FROM "exercise_groups" WHERE ("exercise_groups"."id" = 244)
INSERT INTO "registrations" ("created_at", "updated_at", "exercise_group_id", "user_id") VALUES('2009-12-03 22:26:11.789631', '2009-12-03 22:26:11.789631', 244, 4) RETURNING "id"
SELECT * FROM "users" WHERE ("users"."id" = 4)
---
  def create

  #  if not ExerciseGroup.find(params[:exercise_group_id]).max_registrations.nil?

      @registrations = Registration.find_all_by_exercise_group_id(params[:exercise_group_id])

      if @registrations.nil? or @registrations.class == Array

        if (not @registrations.nil?) and @registrations.nitems >= ExerciseGroup.find(params[:exercise_group_id]).max_registrations
          redirect_to (:controller => :exercise_groups, :action => :show, :id => params[:exercise_group_id])
        else
          Registration.create :user_id => session[:user_id], :exercise_group_id => params[:exercise_group_id], :exam_id => 0
          Newsfeed.join_exercise_group(User.find(session[:user_id]), ExerciseGroup.find(params[:exercise_group_id]))

INSERT INTO "registrations" ("created_at", "updated_at", "exercise_group_id", "user_id", "exam_id") VALUES('2009-12-11 06:19:50.511183', '2009-12-11 06:19:50.511183', 0, 7, 1) RETURNING "id"
---
  def exam
    Registration.create :user_id => session[:user_id], :exam_id => params[:exam_id], :exercise_group_id => 0