app/controllers/users_controller.rb

  def show

    if not User.exists?(params[:id])
      flash[:notice] = "User not found"
      redirect_to(:action => "index")
    else
      @user = User.find(params[:id])
---
SELECT "users".id FROM "users" WHERE ("users"."id" = E'12') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "created_at", "avatar_file_name", "avatar_file_size", "updated_at", "hashed_password", "username", "lastname", "avatar_content_type", "firstname", "avatar_updated_at") VALUES(E'21726222000.675497896913172', '2009-12-04 13:05:45.546997', E'Gerard_ter_Borch__II__019.jpg', 146987, '2009-12-04 13:05:45.546997', E'e971f18adf34922af6008112baf811be27b5a9ae', E'sdfsdfdsf', E'fdsfsdfds', E'image/jpeg', E'sdfdsfs', '2009-12-04 13:05:44.686503') RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-11-19 16:11:14.754757', "salt" = E'21823389000.0848919996137412', "hashed_password" = E'c2f9636ce7a1906b0443f85614877a8cf52afee2' WHERE "id" = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
DELETE FROM "users" WHERE "id" = 4